Tekla Open API Reference for Tekla Structures 2025
Face.GetLoopEnumerator Method
 Gets a new loop enumerator for enumerating through the face's loops.
 Namespace: Tekla.Structures.Solid
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LoopEnumerator GetLoopEnumerator()
Public Function GetLoopEnumerator As LoopEnumerator
Return Value
Type: LoopEnumerator
The new loop enumerator.
See Also
Reference
Face Class
Tekla.Structures.Solid Namespace